In [1]:
import numpy as np
import pandas as pd

In [2]:
## Pandas and numpy can id and detect null values

pd.isnull(np.nan)

True

In [3]:
pd.isnull(None)

True

In [4]:
pd.isna(np.nan)

True

In [5]:
pd.isna(None)

True

In [6]:
pd.notnull(None)

False

In [7]:
pd.notnull(14)

True

In [8]:
pd.isnull(pd.Series([1,np.nan,7]))

0    False
1     True
2    False
dtype: bool

In [9]:
pd.notnull(pd.Series([1,np.nan,7]))

0     True
1    False
2     True
dtype: bool

In [10]:
pd.isnull(pd.DataFrame({
    'Column A': [1,np.nan,7],
    'Column B': [np.nan, 2,3],
    'Column C': [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

In [13]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, np.nan],
    'Column D': [5, 8, 34, 110]
})

In [14]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN       NaN       110

In [15]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True      True     False

In [16]:
df.isnull().sum()

Column A    2
Column B    1
Column C    2
Column D    0
dtype: int64

In [17]:
# df.dropna will drop rows where null is present

df2 = df.copy()

In [18]:
df2

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN       NaN       110

In [20]:
df2.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [21]:
df2.dropna(axis=1) # axis = 'column' also works

   Column D
0         5
1         8
2        34
3       110

In [22]:
df2 = pd.DataFrame({
    'Column A': [1,np.nan,30],
    'Column B': [2,np.nan,31],
    'Column C': [np.nan,np.nan,100]
})

In [23]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [24]:
df2.dropna(how='all')

   Column A  Column B  Column C
0       1.0       2.0       NaN
2      30.0      31.0     100.0

In [25]:
df2.dropna(how='any') # Default behavior

   Column A  Column B  Column C
2      30.0      31.0     100.0

In [26]:
df.dropna(thresh=3) # Need thresh = x amount of values  in order to keep the row

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [27]:
df.dropna(thresh=3, axis = 'columns')

   Column B  Column D
0       2.0         5
1       8.0         8
2      31.0        34
3       NaN       110

In [35]:
s = pd.DataFrame({
    'Column A':[1.0,2.0,3.0,np.nan,np.nan,4.0]
})

In [36]:
s

   Column A
0       1.0
1       2.0
2       3.0
3       NaN
4       NaN
5       4.0

In [37]:
s.fillna(0)

   Column A
0       1.0
1       2.0
2       3.0
3       0.0
4       0.0
5       4.0

In [38]:
s.fillna(s.mean())

   Column A
0       1.0
1       2.0
2       3.0
3       2.5
4       2.5
5       4.0

In [39]:
s.fillna(method='ffill'
        )

   Column A
0       1.0
1       2.0
2       3.0
3       3.0
4       3.0
5       4.0

In [40]:
s.fillna(method='bfill')

   Column A
0       1.0
1       2.0
2       3.0
3       4.0
4       4.0
5       4.0

In [41]:
len(s)

6

In [42]:
s.count()

Column A    4
dtype: int64

In [43]:
missing_values = s.count() != len(s)

In [45]:
missing_values

Column A    True
dtype: bool

In [47]:
pd.Series([True,False,False]).any()

True

In [48]:
pd.Series([True,False,False]).all()

False

In [49]:
pd.Series([True,True,True]).all()

True

In [50]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN       NaN       110

In [51]:
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      20.5         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0      20.5       110